,loss,accuracy,val_loss,val_accuracy
0,0.0672123059630394,0.88673335313797,0.013654623180627823,0.980400025844574
1,0.01356036588549614,0.9813833236694336,0.008369428105652332,0.9884999990463257
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 32)        832       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 32)        0         
_________________________________________________________________
dropout (Dropout)            (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          51264     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4, 4, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               131200    
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                1290      
=================================================================
Total params: 184,586
Trainable params: 184,586
Non-trainable params: 0
_________________________________________________________________
,loss,accuracy,val_loss,val_accuracy
0,0.06523693352937698,0.8954499959945679,0.013774850405752659,0.9817000031471252
1,0.014235821552574635,0.9807666540145874,0.008366769179701805,0.9879000186920166
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 32)        832       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 32)        0         
_________________________________________________________________
dropout (Dropout)            (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          51264     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4, 4, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               131200    
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                1290      
=================================================================
Total params: 184,586
Trainable params: 184,586
Non-trainable params: 0
_________________________________________________________________
,loss,accuracy,val_loss,val_accuracy
0,0.06090836971998215,0.9047499895095825,0.013316589407622814,0.9811999797821045
1,0.01341232005506754,0.981333315372467,0.007890554144978523,0.9890000224113464
2,0.009220864623785019,0.9875166416168213,0.006047092843800783,0.9905999898910522
3,0.006962503772228956,0.9904999732971191,0.005643534008413553,0.9911999702453613
4,0.00566169572994113,0.9918833374977112,0.005781527142971754,0.9914000034332275
5,0.004739809315651655,0.993483304977417,0.004994275514036417,0.9923999905586243
6,0.004010630771517754,0.9948833584785461,0.005748711060732603,0.9925000071525574
7,0.003391656558960676,0.9957000017166138,0.004950586706399918,0.9930999875068665
8,0.003033387940376997,0.9957333207130432,0.0046422965824604034,0.9936000108718872
9,0.0027298741042613983,0.9966999888420105,0.005145418457686901,0.9929999709129333
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 32)        832       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 32)        0         
_________________________________________________________________
dropout (Dropout)            (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          51264     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4, 4, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               131200    
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                1290      
=================================================================
Total params: 184,586
Trainable params: 184,586
Non-trainable params: 0
_________________________________________________________________
,loss,accuracy,val_loss,val_accuracy
0,0.0747811496257782,0.8677499890327454,0.012279977090656757,0.9822999835014343
1,0.013429174199700356,0.979616641998291,0.0068951742723584175,0.9894999861717224
2,0.008831512182950974,0.9868666529655457,0.006205232813954353,0.9900000095367432
3,0.00660787895321846,0.9904166460037231,0.005229741334915161,0.9916999936103821
4,0.005363925360143185,0.9918166399002075,0.006028130650520325,0.9904999732971191
5,0.0045041246339678764,0.993233323097229,0.004465983249247074,0.9914000034332275
6,0.003819851903244853,0.9943333268165588,0.004894962999969721,0.9923999905586243
7,0.0028532911092042923,0.9959166646003723,0.004413011018186808,0.9925000071525574
8,0.002758021466434002,0.9955999851226807,0.0048367418348789215,0.9926000237464905
9,0.0024516985286027193,0.9965833425521851,0.004299344029277563,0.9933000206947327
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 32)        832       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 32)        0         
_________________________________________________________________
dropout (Dropout)            (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          51264     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 64)          0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4, 4, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               131200    
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                650       
=================================================================
Total params: 192,202
Trainable params: 192,202
Non-trainable params: 0
_________________________________________________________________
